In [30]:
# 데이터 불러오기

In [31]:
# 1) csv 파일 불러오기

In [32]:
import pandas as pd

In [33]:
pd.read_csv('C:/ex/data/student.csv', encoding='cp949')

   ID  학생명    키  몸무게  나이 성별
0   1  홍일동  166   59  19  남
1   2  홍이동  168  600  19  여
2   3  홍삼동  170   33  19  남
3   4  홍사동  172   32  19  여
4   5  홍오동  174   30  19  남

In [34]:
df_stu1 = pd.read_csv('C:/ex/data/student.csv', encoding='cp949')

In [35]:
df_stu1.columns

Index(['ID', '학생명', '키', '몸무게', '나이', '성별'], dtype='object')

In [36]:
df_stu1.ID

0    1
1    2
2    3
3    4
4    5
Name: ID, dtype: int64

In [37]:
type(df_stu1)

pandas.core.frame.DataFrame

In [38]:
df_stu1['몸무게']

0     59
1    600
2     33
3     32
4     30
Name: 몸무게, dtype: int64

In [39]:
type(df_stu1['몸무게'])   # 시리즈란 인덱스가 있는 배열

pandas.core.series.Series

In [40]:
df_stu1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   학생명     5 non-null      object
 2   키       5 non-null      int64
 3   몸무게     5 non-null      int64
 4   나이      5 non-null      int64
 5   성별      5 non-null      object
dtypes: int64(4), object(2)
memory usage: 372.0+ bytes

In [41]:
df_stu1.describe()

             ID           키         몸무게    나이
count  5.000000    5.000000    5.000000   5.0
mean   3.000000  170.000000  150.800000  19.0
std    1.581139    3.162278  251.391527   0.0
min    1.000000  166.000000   30.000000  19.0
25%    2.000000  168.000000   32.000000  19.0
50%    3.000000  170.000000   33.000000  19.0
75%    4.000000  172.000000   59.000000  19.0
max    5.000000  174.000000  600.000000  19.0

In [42]:
df_stu1.head(3)    # head 기본값은 5개

   ID  학생명    키  몸무게  나이 성별
0   1  홍일동  166   59  19  남
1   2  홍이동  168  600  19  여
2   3  홍삼동  170   33  19  남

In [43]:
df_stu1.describe(include='all')

              ID  학생명           키         몸무게    나이   성별
count   5.000000    5    5.000000    5.000000   5.0    5
unique       NaN    5         NaN         NaN   NaN    2
top          NaN  홍일동         NaN         NaN   NaN    남
freq         NaN    1         NaN         NaN   NaN    3
mean    3.000000  NaN  170.000000  150.800000  19.0  NaN
std     1.581139  NaN    3.162278  251.391527   0.0  NaN
min     1.000000  NaN  166.000000   30.000000  19.0  NaN
25%     2.000000  NaN  168.000000   32.000000  19.0  NaN
50%     3.000000  NaN  170.000000   33.000000  19.0  NaN
75%     4.000000  NaN  172.000000   59.000000  19.0  NaN
max     5.000000  NaN  174.000000  600.000000  19.0  NaN

In [44]:
df_stu1['키']

0    166
1    168
2    170
3    172
4    174
Name: 키, dtype: int64

In [45]:
df_stu1['키'].values

array([166, 168, 170, 172, 174], dtype=int64)

In [46]:
height = df_stu1['키'].values

In [47]:
height.var()

8.0

In [48]:
# help(pd.DataFrame)

In [55]:
stu_dic = {'학생명':['홍일동','홍이동','홍삼동','홍사동','홍오동']}

In [56]:
type(stu_dic)

dict

In [57]:
pd.DataFrame(stu_dic)

   학생명
0  홍일동
1  홍이동
2  홍삼동
3  홍사동
4  홍오동

In [58]:
id = {'id':[1,2,3,4,5]}

In [59]:
pd.DataFrame(stu_dic)

   학생명
0  홍일동
1  홍이동
2  홍삼동
3  홍사동
4  홍오동

In [60]:
pd.DataFrame(id)

   id
0   1
1   2
2   3
3   4
4   5

In [61]:
import numpy as np

In [62]:
frame = np.array([[1,'홍일동',166,59,19,'남'],
                 [2,'홍이동',168,600,19,'여'],
                 [3,'홍삼동',170,33,19,'남'],
                 [4,'홍사동',172,32,19,'여'],
                 [5,'홍오동',174,30,19,'남']])

In [29]:
pd.DataFrame(data=frame,columns=['id','이름','키','몸무게','나이','성별'])

  id   이름    키  몸무게  나이 성별
0  1  홍일동  166   59  19  남
1  2  홍이동  168  600  19  여
2  3  홍삼동  170   33  19  남
3  4  홍사동  172   32  19  여
4  5  홍오동  174   30  19  남

In [156]:
stu_df = pd.DataFrame(data=frame,columns=['id','이름','키','몸무게','나이','성별'])

In [157]:
stu_df.columns

Index(['id', '이름', '키', '몸무게', '나이', '성별'], dtype='object')

In [158]:
stu_df.index

RangeIndex(start=0, stop=5, step=1)

In [159]:
stu_df.set_index('id',inplace=True)

In [160]:
stu_df

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여
3   홍삼동  170   33  19  남
4   홍사동  172   32  19  여
5   홍오동  174   30  19  남

In [161]:
stu_df.iloc[0]     # index를 이용하여

이름     홍일동
키      166
몸무게     59
나이      19
성별       남
Name: 1, dtype: object

In [162]:
stu_df.loc['1']   # 키값을 이용하여

이름     홍일동
키      166
몸무게     59
나이      19
성별       남
Name: 1, dtype: object

In [163]:
stu_df['성별']

id
1    남
2    여
3    남
4    여
5    남
Name: 성별, dtype: object

In [164]:
stu_df[['키','나이']]    # index 자체로 받아들여야 하므로 리스트 자체를 인덱스로 받음

      키  나이
id
1   166  19
2   168  19
3   170  19
4   172  19
5   174  19

In [165]:
stu_df.iloc[[1,4]]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여
5   홍오동  174   30  19  남

In [166]:
stu_df.loc[['2','5']]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여
5   홍오동  174   30  19  남

In [244]:
stu_df.iloc[2]['몸무게']

'33'

In [168]:
stu_df.loc['2']['몸무게']

'600'

In [169]:
stu_df[(stu_df['몸무게'].astype(int)==600)]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여

In [170]:
# 홍삼동,홍오동의 몸무게와 나이

In [171]:
stu_df.loc[['3','5']][['몸무게','나이']]

   몸무게  나이
id
3   33  19
5   30  19

In [172]:
# 1. 키가 170 이상인 남자, (홍삼동,홍오동)
# 2. 몸무게가 50 이상인 여자, (홍이동)
# 3. 키가 170미만이면서 몸무게가 50이상인 사람 ( 홍일동, 홍이동)
# 4. 키가 170미만이거나 몸무게가 50이상인 사람 (홍일동, 홍이동)

In [176]:
# 1.
stu_df[(stu_df['키'].astype(int) >= 170 ) & (stu_df['성별'] == '남')]

     이름    키 몸무게  나이 성별
id
3   홍삼동  170  33  19  남
5   홍오동  174  30  19  남

In [180]:
2.
stu_df[(stu_df['몸무게'].astype(int) >= 50) & (stu_df['성별']== '여')]

     이름    키  몸무게  나이 성별
id
2   홍이동  168  600  19  여

In [181]:
3.
stu_df[(stu_df['키'].astype(int) < 170) & (stu_df['몸무게'].astype(int) >= 50 )]

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여

In [182]:
4. 
stu_df[(stu_df['키'].astype(int) < 170) | (stu_df['몸무게'].astype(int) >= 50 )]

     이름    키  몸무게  나이 성별
id
1   홍일동  166   59  19  남
2   홍이동  168  600  19  여

In [183]:
pd.Series(['남','여'])

0    남
1    여
dtype: object

In [186]:
di = {'a':'apple','b':'banana','c':'candy'}

In [187]:
pd.Series(di)

a     apple
b    banana
c     candy
dtype: object

In [188]:
ser1 = pd.Series(di)

In [189]:
pd.DataFrame(ser1)

        0
a   apple
b  banana
c   candy

In [215]:
df_fruit = pd.DataFrame(ser1)

In [216]:
df_fruit

        0
a   apple
b  banana
c   candy

In [217]:
df_fruit.columns = ['fruit']

In [218]:
df_fruit

    fruit
a   apple
b  banana
c   candy

In [219]:
df_fruit.columns

Index(['fruit'], dtype='object')

In [220]:
df_fruit.columns = ['fruit2']

In [221]:
df_fruit

   fruit2
a   apple
b  banana
c   candy

In [222]:
di2 = {'a':'anaconda','b':'black_yart','c':'cat'}

In [223]:
df_fruit['animal'] = di2

In [224]:
df_fruit

   fruit2      animal
a   apple    anaconda
b  banana  black_yart
c   candy         cat

In [225]:
di3 = {'a':'albatross','b':'bald_eagle','c':'crane'}

In [226]:
df_fruit['bird'] = di3

In [227]:
df_fruit

   fruit2      animal        bird
a   apple    anaconda   albatross
b  banana  black_yart  bald_eagle
c   candy         cat       crane

In [1]:
df_fruit.loc['c']['animal']

NameError: name 'df_fruit' is not defined

In [230]:
df_fruit.iloc[2,1]

'cat'

In [231]:
df_fruit.iloc[2,1] = 'dog'

In [232]:
df_fruit

   fruit2      animal        bird
a   apple    anaconda   albatross
b  banana  black_yart  bald_eagle
c   candy         dog       crane

In [234]:
df_fruit.drop('animal', axis=1, inplace=True)

In [235]:
df_fruit

   fruit2        bird
a   apple   albatross
b  banana  bald_eagle
c   candy       crane

In [236]:
df_fruit.drop('b', axis=0, inplace=True)

In [237]:
df_fruit

  fruit2       bird
a  apple  albatross
c  candy      crane